# Day 2 â€“ Pandas & Data Preprocessing
- Membuat DataFrame
- Mengakses & memanipulasi data
- Cleaning & handling missing values
- Mapping / Encoding
- Scaling: Normalization & Standardization

In [1]:
import pandas as pd
print(f"Pandas version: {pd.__version__}")

Pandas version: 2.3.3

In [2]:
# Membuat dataset mini
data = {
    "Nama": ["Dapala", "Rina", "Budi", "Sari"],
    "Umur": [20, 22, 19, 21],
    "Gaji": [5000, 7000, 4500, 6000],
    "Status_Menikah": ["Belum", "Sudah", "Belum", "Sudah"]
}

# Buat DataFrame
df = pd.DataFrame(data)

# Tampilkan DataFrame
df

     Nama  Umur  Gaji Status_Menikah
0  Dapala    20  5000          Belum
1    Rina    22  7000          Sudah
2    Budi    19  4500          Belum
3    Sari    21  6000          Sudah

In [3]:
# Cek apakah ada nilai kosong (NaN) di DataFrame
df.isnull()

    Nama   Umur   Gaji  Status_Menikah
0  False  False  False           False
1  False  False  False           False
2  False  False  False           False
3  False  False  False           False

In [4]:
# Jumlah nilai kosong per kolom
df.isnull().sum()

Nama              0
Umur              0
Gaji              0
Status_Menikah    0
dtype: int64

In [5]:
# Mapping kategori ke angka
df['Status_Menikah'] = df['Status_Menikah'].map({"Belum": 0, "Sudah": 1})

df

     Nama  Umur  Gaji  Status_Menikah
0  Dapala    20  5000               0
1    Rina    22  7000               1
2    Budi    19  4500               0
3    Sari    21  6000               1

In [7]:
from sklearn.preprocessing import MinMaxScaler

# Pilih kolom numeric
kolom_numeric = ['Umur', 'Gaji', 'Status_Menikah']

# Buat scaler
scaler = MinMaxScaler()

# Transform data
df_normalized = df.copy()  # salin DataFrame
df_normalized[kolom_numeric] = scaler.fit_transform(df_normalized[kolom_numeric])

df_normalized

     Nama      Umur  Gaji  Status_Menikah
0  Dapala  0.333333   0.2             0.0
1    Rina  1.000000   1.0             1.0
2    Budi  0.000000   0.0             0.0
3    Sari  0.666667   0.6             1.0

In [8]:
from sklearn.preprocessing import StandardScaler

scaler_std = StandardScaler()
df_standardized = df.copy()
df_standardized[kolom_numeric] = scaler_std.fit_transform(df_standardized[kolom_numeric])

df_standardized

     Nama      Umur      Gaji  Status_Menikah
0  Dapala -0.447214 -0.650945            -1.0
1    Rina  1.341641  1.432078             1.0
2    Budi -1.341641 -1.171700            -1.0
3    Sari  0.447214  0.390567             1.0

Simpan ke CSV

In [9]:
# Simpan DataFrame yang sudah distandardisasi
df_standardized.to_csv("Day2_Standarisasi.csv", index=False)

Simpan ke Database

In [11]:
from sqlalchemy import create_engine

# Buat koneksi ke PostgreSQL
engine = create_engine('postgresql+psycopg2://postgres:1234@localhost:5432/Roadmap_DE')

# Simpan DataFrame sebagai tabel baru
df_standardized.to_sql('day2_Standarisasi', engine, if_exists='replace', index=False)

4

# CRUD

In [12]:
from sqlalchemy import create_engine
import pandas as pd

# Ganti USERNAME & PASSWORD sesuai database kamu
engine = create_engine('postgresql+psycopg2://postgres:1234@localhost:5432/Roadmap_DE')

In [15]:
from sqlalchemy import text

with engine.connect() as conn:
    result = conn.execute(text("SELECT table_name FROM information_schema.tables WHERE table_schema='public';"))
    for row in result:
        print(row)

('day2_Standarisasi',)

In [16]:
from sqlalchemy import text
import pandas as pd

# Baca data tabel yang benar
df = pd.read_sql('SELECT * FROM "day2_Standarisasi"', engine)
df

     Nama      Umur      Gaji  Status_Menikah
0  Dapala -0.447214 -0.650945            -1.0
1    Rina  1.341641  1.432078             1.0
2    Budi -1.341641 -1.171700            -1.0
3    Sari  0.447214  0.390567             1.0

In [17]:
import pandas as pd

# Data baru
data_baru = pd.DataFrame({
    "Nama": ["Andi"],
    "Umur": [23],
    "Gaji": [5500],
    "Status_Menikah": [0]  # 0 = Belum, 1 = Sudah
})

In [18]:
data_baru.to_sql('day2_Standarisasi', engine, if_exists='append', index=False)

1

In [19]:
from sqlalchemy import text

df = pd.read_sql('SELECT * FROM "day2_Standarisasi"', engine)
df

     Nama       Umur         Gaji  Status_Menikah
0  Dapala  -0.447214    -0.650945            -1.0
1    Rina   1.341641     1.432078             1.0
2    Budi  -1.341641    -1.171700            -1.0
3    Sari   0.447214     0.390567             1.0
4    Andi  23.000000  5500.000000             0.0

In [6]:
from sqlalchemy import create_engine, text
import pandas as pd

# Ganti USERNAME & PASSWORD sesuai PostgreSQL kamu
engine = create_engine('postgresql+psycopg2://postgres:1234@localhost:5432/Roadmap_DE')

In [8]:
from sqlalchemy import text

with engine.connect() as conn:
    conn.execute(text('UPDATE "day2_Standarisasi" SET "Gaji" = 6000 WHERE "Nama" = \'Andi\';'))

In [9]:
import pandas as pd

df = pd.read_sql('SELECT * FROM "day2_Standarisasi"', engine)
df

     Nama       Umur         Gaji  Status_Menikah
0  Dapala  -0.447214    -0.650945            -1.0
1    Rina   1.341641     1.432078             1.0
2    Budi  -1.341641    -1.171700            -1.0
3    Sari   0.447214     0.390567             1.0
4    Andi  23.000000  5500.000000             0.0

In [12]:
from sqlalchemy import create_engine, text

engine = create_engine('postgresql+psycopg2://postgres:1234@localhost:5432/Roadmap_DE')

In [15]:
with engine.begin() as conn:  # begin() otomatis commit
    conn.execute(text('DELETE FROM "day2_Standarisasi" WHERE "Nama" = \'Andi\';'))

In [16]:
import pandas as pd

df = pd.read_sql('SELECT * FROM "day2_Standarisasi"', engine)
df

     Nama      Umur      Gaji  Status_Menikah
0  Dapala -0.447214 -0.650945            -1.0
1    Rina  1.341641  1.432078             1.0
2    Budi -1.341641 -1.171700            -1.0
3    Sari  0.447214  0.390567             1.0

Selesai